Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::v1::Bend Class Referencefinal
MEP Element Manager
The Bend can connect two straight RoutingSegments with the same dimensions but different directions. More...
#include <MEPBend.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Bend:
 Public Member Functions
~Bend ()
std::optional< double >  | GetInsulationThickness () const
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
double  | GetRadius () const
double  | GetFactorRadius () const
The radius of the Bend is calculated with the help of this value.
UniqueID  | GetRoutingNodeId () const
Domain  | GetDomain () const
BendDefault  | PickUpDefault () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executed the passed modifier scope in an Undoable command.
~Modifier ()
Result< void >  | SetFactorRadius (double factor)
Sets the factor of the radius of the Bend.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Static Public Member Functions
static Result< Bend >  | Get (const UniqueID &uniqueId)
Returns a Bend.
 Public Attributes
friend  | Bend
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ElementBase ()
Detailed Description
The Bend can connect two straight RoutingSegments with the same dimensions but different directions.
This type of element can be placed in RoutingNodes.
Since
Archicad 27
Example code snippet from Test/New MEP
Getters
 ACAPI::Result<Bend> bend = Bend::Get (id);
 if (bend.IsErr ()) {
 ACAPI_WriteReport (bend.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter bendReporter (3);
 bendReporter.Add ("Bend id", id);
 bendReporter.SetTabCount (4);
 bendReporter.Add ("Factor Radius", bend->GetFactorRadius ());
 bendReporter.Add ("Radius", bend->GetRadius ());
 bendReporter.Add ("Width", bend->GetWidth ());
 bendReporter.Add ("Height", bend->GetHeight ());
 bendReporter.Add ("Shape", bend->GetShape ());
 std::optional<double> insulation = bend->GetInsulationThickness ();
 insulation.has_value () ? bendReporter.Add ("Insulation thickness", *insulation) : bendReporter.Add ("Does not have insulation.");
 bendReporter.Write ();
Constructor & Destructor Documentation
◆ ~Bend()
 ACAPI::MEP::v1::Bend::~Bend  |  ( |   | )
◆ ~Modifier()
 ACAPI::MEP::v1::Bend::~Modifier  |  ( |   | )
Member Function Documentation
◆ Get()
 static Result< Bend > ACAPI::MEP::v1::Bend::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Bend.
Parameters
uniqueId | The UniqueID of the requested Bend.
Returns
If the uniqueId belongs to a Bend, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::v1::Bend::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the Bend.
◆ GetFactorRadius()
 double ACAPI::MEP::v1::Bend::GetFactorRadius  |  ( |   | ) |   const
The radius of the Bend is calculated with the help of this value.
Returns
Returns the factor of the Bend.
◆ GetHeight()
 double ACAPI::MEP::v1::Bend::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the Bend.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::v1::Bend::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the Bend has insulation, otherwise std::nullopt. Bend of cable carrier domain cannot have insulation.
◆ GetRadius()
 double ACAPI::MEP::v1::Bend::GetRadius  |  ( |   | ) |   const
Returns
Returns the radius of the Bend.
◆ GetRoutingNodeId()
 UniqueID ACAPI::MEP::v1::Bend::GetRoutingNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode that it belongs to.
◆ GetShape()
 ConnectorShape ACAPI::MEP::v1::Bend::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the Bend.
◆ GetWidth()
 double ACAPI::MEP::v1::Bend::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the Bend.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::Bend::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executed the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appear in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 BendDefault ACAPI::MEP::v1::Bend::PickUpDefault  |  ( |   | ) |   const
Returns
Returns a BendDefault with the parameters of the object it was called for.
◆ SetFactorRadius()
 Result< void > ACAPI::MEP::v1::Bend::SetFactorRadius  |  ( |  double  |  factor | )
Sets the factor of the radius of the Bend.
Parameters
factor | The value to be set. Needs to be between 0.6 and 3.0.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
Member Data Documentation
◆ Bend
 friend ACAPI::MEP::v1::Bend::Bend